Case/constant/0_org/CR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 1 0 0 0];


internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    leftair
    {
        type            zeroGradient;
    }
    leftwall
    {
        type            zeroGradient;
    }
    rightair
    {
        type            zeroGradient;
    }
    rightwall
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    backwall1
    {
        type            zeroGradient;
    }
    backwall2
    {
        type            zeroGradient;
    }
    frontwall1
    {
        type            zeroGradient;
    }
    frontwall2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
