Case/constant/0_org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   uniform 300;

boundaryField
{
    top
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/0.0177";
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    leftair
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/0.0177";
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    leftwall
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/13.4";                    // 13.4 SS thermal conductivity at room temp
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    rightair
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/0.0177";
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    rightwall
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/13.4";                    // 13.4 SS thermal conductivity at room temp
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    bottomWall
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/13.4";                    // 13.4 SS thermal conductivity at room temp
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    backwall1
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/13.4";                    // 13.4 SS thermal conductivity at room temp
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    backwall2
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/0.0177";
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    frontwall1
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/13.4";                    // 13.4 SS thermal conductivity at room temp
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
    frontwall2
    {
        type            groovyBC;
        value           uniform 300;
        gradientExpression "heatFlux/0.0177";
        fractionExpression "0";
        variables (
            "h=10;"
            "Tref=300;"
            "heatFlux= -h*(T-Tref);"
        );
        timelines       (
        );
    }
}


// ************************************************************************* //
