Case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 5.52e-7;          
    rho             [1 -3 0 0 0 0 0] 2643.34;            
} 

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.38e-5; 
    rho             [1 -3 0 0 0 0 0] 1.6337;  
}

sigma                           [1 0 -2 0 0 0 0]    1.6;                  

cps                         cps [0 2 -2 -1 0 0 0]   1166.69;   
cpl                         cpl [0 2 -2 -1 0 0 0]   1100.18; 
cp2                         cp2 [0 2 -2 -1 0 0 0]   520; 

ks                           ks [1 1 -3 -1 0 0 0]   194.46;    
kl                           kl [1 1 -3 -1 0 0 0]   92.3;     
k2                           k2 [1 1 -3 -1 0 0 0]   0.0177; 

beta1                     beta1 [0 0 0 -1 0 0 0]    0.85e-4;   
beta2                     beta2 [0 0 0 -1 0 0 0]    3.4112e-3; 

Tl                           Tl [0 0 0 1 0 0 0]     918.19;    
Ts                           Ts [0 0 0 1 0 0 0]     843.95;    
L                             L [0 2 -2 0 0 0 0]    3.91e+5;   
C                             C [1 -3 -1 0 0 0 0]   1.5e+6; 
b                             b [0 0 0 0 0 0 0]     1e-10;
dsigmadt               dsigmadt [1 0 -2 -1 0 0 0]  -1.56e-4;   

E                             E [0 0 0 0 0 0 0]     0.09;                           
sig                         sig [1 0 -3 -4 0 0 0]   5.67e-8;
Tref                       Tref [0 0 0 1 0 0 0]     300;
h1                           h1 [1 0 -3 -1 0 0 0]   10; 

L_v                         L_v [0 2 -2 0 0 0 0]    1.05e+7;   
R                             R [1 2 -2 -1 -1 0 0]  8.3143;
M                             M [1 0 0 0 -1 0 0]    0.026;     
P_0                         P_0 [1 -1 -2 0 0 0 0]   101000; 
T_v                         T_v [0 0 0 1 0 0 0]     2747.14;     





