Case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

     leftair
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    leftwall
    {
        type            noSlip;
    }
   
    rightair
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    rightwall
    {
        type            noSlip;
    }

    bottomWall
    {
        type            noSlip;
    }

    backwall1
    {
        type            noSlip;
    }


    backwall2
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    frontwall1
    {
        type            noSlip;
    }


    frontwall2
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
   
}


// ************************************************************************* //
