Case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            totalPressure;
        p0              uniform 0;
    }
    leftair
    {
        type            totalPressure;
        p0              uniform 0;
    }

    leftwall
    {
        type            zeroGradient;
    }
   
    rightair
    {
        type            totalPressure;
        p0              uniform 0;
    }

    rightwall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    backwall1
    {
        type            zeroGradient;
    }

    backwall2
    {
        type            totalPressure;
        p0              uniform 0;
    }


    frontwall1
    {
        type            zeroGradient;
    }

    frontwall2
    {
        type            totalPressure;
        p0              uniform 0;
    }

   
}

// ************************************************************************* //
