Case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)  Gauss upwind;
    div(phi,alpha)  Gauss upwind;
    div(phirb,alpha) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
//    div(rhoCpphi,T)  Gauss limitedLinear 1;
    div((interpolate((((alpha.water*rho)*((cps*(1-lf))+(cpl*lf)))+((alpha.air*rho)*cp2)))*phi),T) Gauss upwind;
    //div(rhoCpphi,T)  Gauss vanLeer;
//    div(rhoAlpha1Phi,lf)  Gauss vanLeer;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
